app/Controllers/OperateurController.php

    public function index() {
        $session = session();
        $operateur = $session->get('operateur');
        if (!$operateur) return redirect()->to('/login_Operateur');

        $prefixeOperateurModel = new PrefixeOperateurModel();
        $transactionModel = new TransactionModel();
        $clientModel = new ClientModel();

        $prefixe = $prefixeOperateurModel->getAllPrefix();
        $gains = $transactionModel->getGainsByType();
        $totalGains = 0;
        foreach ($gains as $g) $totalGains += $g->total_gains;

        $clients = $clientModel->findAll();
---
SELECT *
FROM `Client`

    public function gestionClients (){
        $session = session();
        if (!$session->get('operateur')) return redirect()->to('/login_Operateur');

        $clientModel = new ClientModel();
        $transactionModel = new TransactionModel();

        $clients = $clientModel->findAll();
---
SELECT *
FROM `Client`
WHERE SUBSTR(numero, 1, 3) IN ('034','038')

    public function gestionFrais() {
        $session = session();
        if (!$session->get('operateur')) return redirect()->to('/login_Operateur');

        $typeModel = new TypeTransactionModel();
        $trancheModel = new TrancheModel();
        $prefixeModel = new PrefixeOperateurModel();
        $transactionModel = new TransactionModel();

        $types = $typeModel->findAll();
---
SELECT *
FROM `Type_transaction`

    public function updateTranche() {
        $session = session();
        if (!$session->get('operateur')) return $this->response->setJSON(['success' => false, 'error' => 'Non autorisé']);
---
SELECT *
FROM `Operateur`