app/Controllers/TransactionController.php

INSERT INTO `Transaction` (`id_type`, `id_tranche`, `montant`, `frais`, `id_client`) VALUES (1, 1, '10000', 0, 9)
---
    public function traiter_depot() {
        $user = session()->get('user');
        $transaction = new TransactionModel();
        $montant = $this->request->getVar('amount');

        if (!$montant) {
            return redirect()->back()->with('error', 'Montant invalide');
        }

        $transaction->insert([
            'id_type'    => 1,
            'id_tranche' => 1,
            'montant'    => $montant,
            'frais'      => 0,
            'id_client'  => $user['id'],
        ]);