app/Models/ClientModel.php

    public function getClientByNumero ($numero){
        return $this->where('numero', $numero)->first();
---
SELECT *
FROM `Client`
WHERE `numero` = '0333333333'
 LIMIT 1