app/Models/CommissionInterOperateurModel.php

SELECT `c`.*, `o`.`nom` AS `operateur_nom`
FROM `Commission_inter_operateur` `c`
JOIN `Operateur` `o` ON `c`.`id_operateur` = `o`.`id`
ORDER BY `o`.`nom`
---
    public function getAll() {
        $db = $this->db->table('Commission_inter_operateur c');
        $db->select('c.*, oe.nom AS emetteur_nom, od.nom AS destinataire_nom');
        $db->join('Operateur oe', 'c.operateur_emetteur_id = oe.id');
        $db->join('Operateur od', 'c.operateur_destinataire_id = od.id');
        $db->orderBy('oe.nom, od.nom');
        return $db->get()->getResult();