app/Models/OperateurModel.php

    public function getOperateurByNomAndPassword ($nom, $mot_de_passe){
        return $this->where('nom', $nom)->where('mot_de_passe', $mot_de_passe)->first();
---
SELECT *
FROM `Operateur`
WHERE `nom` = 'admin'
AND `mot_de_passe` = 'admin'
 LIMIT 1

    public function getPrefixesByOperateur($operateur_id) {
        $db = $this->db->table('Operateur_prefix op');
        $db->select('p.id, p.Prefix');
        $db->join('Prefix_operateur p', 'op.prefix_id = p.id');
        $db->where('op.operateur_id', $operateur_id);
        return $db->get()->getResult();
---
SELECT `id`, `Prefix` AS `Prefix`
FROM `Prefix_operateur`
WHERE `id_operateur` = 1
SELECT `p`.`id`, `p`.`Prefix`
FROM `Operateur_prefix` `op`
JOIN `Prefix_operateur` `p` ON `op`.`prefix_id` = `p`.`id`
WHERE `op`.`operateur_id` = 1