app/Models/PromotionModel.php

    public function getProm($id) {
        return $this->where('id', $id)->first();
---
SELECT *
FROM `Promotion`
WHERE `id` = 1
 LIMIT 1