app/Models/TrancheModel.php

SELECT *
FROM `Tranche`
WHERE `id_type` = 1
---
    public function getTrancheByType($id_type) {
        return $this->where('id_type', $id_type)->findAll();

SELECT *
FROM `Tranche`
WHERE `id_type` = 2
AND `montant_min` <= '9070'
AND `montant_max` >= '9070'
 LIMIT 1
---
    public function findTranche($id_type, $montant){
        return $this->where('id_type', $id_type)
        ->where('montant_min <=', $montant)
        ->where('montant_max >=', $montant)->first();