app/Models/TransactionModel.php

    public function getGainsByOperateur($operateur_id, $type = 'propre')
    {
        if ($type === 'propre') {
            $clientIds = $this->getClientIdsByOperateur($operateur_id);
            if (empty($clientIds)) return [];

            $this->db->table('Transaction t');
            $builder = $this->db->table('Transaction t');
            $builder->select('tt.libelle, SUM(t.frais) AS total_gains, COUNT(*) AS nb_transactions');
            $builder->join('Type_transaction tt', 't.id_type = tt.id');
            $builder->whereIn('t.id_client', $clientIds);
            $builder->groupStart();
            $builder->where('t.operateur_destinataire_id IS NULL');
            $builder->orWhere('t.operateur_destinataire_id', $operateur_id);
            $builder->groupEnd();
            $builder->groupBy('tt.libelle');
            return $builder->get()->getResult();
        }

        $builder = $this->db->table('Transaction t');
        $builder->select('tt.libelle, SUM(t.commission_inter_operateur) AS total_gains, COUNT(*) AS nb_transactions');
        $builder->join('Type_transaction tt', 't.id_type = tt.id');
        $builder->where('t.operateur_destinataire_id', $operateur_id);
        $builder->groupBy('tt.libelle');
        return $builder->get()->getResult();
---
SELECT SUM(`commission_inter_operateur`) AS `total`
FROM `Transaction`
WHERE `operateur_destinataire_id` IS NOT NULL