app/Models/TransactionModel.php

SELECT `t`.*, `tt`.`libelle` as `type_libelle`, `c`.`numero` as `client_numero`, `c2`.`numero` as `client2_numero`
FROM `Transaction` `t`
JOIN `Type_transaction` `tt` ON `t`.`id_type` = `tt`.`id`
LEFT JOIN `Client` `c` ON `t`.`id_client` = `c`.`id`
LEFT JOIN `Client` `c2` ON `t`.`id_client2` = `c2`.`id`
WHERE `t`.`id_client` = 1
ORDER BY `t`.`id` DESC
---
    public function getHistoriqueByClient($id_client)
    {
        return $this->db->table('Transaction t')
            ->select('t.*, tt.libelle as type_libelle, c.numero as client_numero, c2.numero as client2_numero')
            ->join('Type_transaction tt', 't.id_type = tt.id')
            ->join('Client c', 't.id_client = c.id', 'left')
            ->join('Client c2', 't.id_client2 = c2.id', 'left')
            ->where('t.id_client', $id_client)
            ->orderBy('t.id', 'DESC')
            ->get()
            ->getResult();

SELECT COALESCE(SUM(montant + frais), 0) AS total
FROM `Transaction`
WHERE `id_client` = 1
AND `id_type` = 3
SELECT SUM(`montant`) AS `montant`
FROM `Transaction`
WHERE `id_client` = 1
AND `id_type` = 1
SELECT COALESCE(SUM(montant + frais), 0) AS total
FROM `Transaction`
WHERE `id_client` = 1
AND `id_type` = 2
SELECT SUM(`montant`) AS `montant`
FROM `Transaction`
WHERE `id_client2` = 1
AND `id_type` = 3
---
    public function getSolde($id_client)
    {
        $db = $this->db->table('Transaction');

        $depots = $db
            ->selectSum('montant')
            ->where('id_client', $id_client)
            ->where('id_type', 1)
            ->get()
            ->getRow()
            ->montant ?? 0;

        $retraits = $this->db->table('Transaction')
            ->select('COALESCE(SUM(montant + frais), 0) AS total')
            ->where('id_client', $id_client)
            ->where('id_type', 2)
            ->get()
            ->getRow()
            ->total;

        $transfertsEnvoyes = $this->db->table('Transaction')
            ->select('COALESCE(SUM(montant + frais), 0) AS total')
            ->where('id_client', $id_client)
            ->where('id_type', 3)
            ->get()
            ->getRow()
            ->total;

        $transfertsRecus = $this->db->table('Transaction')
            ->selectSum('montant')
            ->where('id_client2', $id_client)
            ->where('id_type', 3)
            ->get()
            ->getRow()
            ->montant ?? 0;

SELECT `tt`.`libelle`, SUM(tr.Frais) AS total_gains
FROM `Transaction` `t`
JOIN `Type_transaction` `tt` ON `t`.`id_type` = `tt`.`id`
JOIN `Tranche` `tr` ON `t`.`id_tranche` = `tr`.`id`
GROUP BY `tt`.`libelle`
---
    public function getGainsByType()
    {
        return $this->db->table('Transaction t')
            ->select('tt.libelle, SUM(t.frais) AS total_gains')
            ->join('Type_transaction tt', 't.id_type = tt.id')
            ->groupBy('tt.libelle')
            ->get()
            ->getResult();

SELECT `t`.`id`, `t`.`montant`, `t`.`id_type`, `t`.`id_client`, `c`.`numero`, `tt`.`libelle`
FROM `Transaction` `t`
JOIN `Client` `c` ON `t`.`id_client` = `c`.`id`
JOIN `Type_transaction` `tt` ON `t`.`id_type` = `tt`.`id`
ORDER BY `t`.`id` DESC
 LIMIT 4
---
    public function getRecentTransactions($limit = 4)
    {
        return $this->db->table('Transaction t')
            ->select('t.id, t.montant, t.id_type, t.id_client, c.numero, tt.libelle')
            ->join('Client c', 't.id_client = c.id')
            ->join('Type_transaction tt', 't.id_type = tt.id')
            ->orderBy('t.id', 'DESC')
            ->limit($limit)
            ->get()
            ->getResult();

SELECT COUNT(*) AS `numrows`
FROM `Transaction`
---
    public function getCount()
    {
        return $this->db->table('Transaction')
            ->countAllResults();

SELECT `Prefix`
FROM `Prefix_operateur`
WHERE `id_operateur` = 1
SELECT `id`
FROM `Client`
WHERE SUBSTR(numero, 1, 3) IN ('034','038')
---
    private function getClientIdsByOperateur($operateur_id)
    {
        $prefixes = $this->db->table('Prefix_operateur')
            ->select('Prefix')
            ->where('id_operateur', $operateur_id)
            ->get()
            ->getResult();

        $prefixList = array_map(function($p) { return $p->Prefix; }, $prefixes);
        if (empty($prefixList)) return [];

        $rows = $this->db->table('Client')
            ->select('id')
            ->whereIn('SUBSTR(numero, 1, 3)', $prefixList)
            ->get()
            ->getResult();

SELECT SUM(`frais`) AS `total`
FROM `Transaction`
WHERE `id_client` IN (1,4,8,10,11,12)
AND `id_type` = 2
SELECT SUM(`frais`) AS `total`
FROM `Transaction`
WHERE `operateur_destinataire_id` IS NOT NULL
---
    public function getGainsSepares($operateur_id)
    {
        $clientIds = $this->getClientIdsByOperateur($operateur_id);
        if (empty($clientIds)) return ['retrait' => 0, 'interne' => 0, 'autres' => 0];

        $retrait = $this->db->table('Transaction')
            ->selectSum('frais', 'total')
            ->whereIn('id_client', $clientIds)
            ->where('id_type', 2)
            ->get()
            ->getRow()
            ->total ?? 0;

        $interne = $this->db->table('Transaction')
            ->selectSum('frais', 'total')
            ->whereIn('id_client', $clientIds)
            ->where('id_type', 3)
            ->where('operateur_destinataire_id IS NULL')
            ->get()
            ->getRow()
            ->total ?? 0;

SELECT `o`.`id`, `o`.`nom`, SUM(t.commission_inter_operateur) AS total
FROM `Transaction` `t`
JOIN `Operateur` `o` ON `t`.`operateur_destinataire_id` = `o`.`id`
WHERE `t`.`operateur_destinataire_id` = 1
GROUP BY `o`.`id`, `o`.`nom`
---
    public function getMontantsAPayer($operateur_id)
    {
        $clientIds = $this->getClientIdsByOperateur($operateur_id);
        if (empty($clientIds)) return [];

        $builder = $this->db->table('Transaction t');
        $builder->select('o.id, o.nom, SUM(t.commission_inter_operateur) AS total');
        $builder->join('Operateur o', 't.operateur_destinataire_id = o.id');
        $builder->where('t.commission_inter_operateur >', 0);
        $builder->whereIn('t.id_client', $clientIds);
        $builder->where('t.operateur_destinataire_id IS NOT NULL');
        $builder->where('t.operateur_destinataire_id !=', $operateur_id);
        $builder->groupBy('o.id, o.nom');
        return $builder->get()->getResult();